# Titanic - data cleaning
üëãüõ≥Ô∏è Ahoy, welcome to Kaggle! You‚Äôre in the right place.
<a href="https://www.kaggle.com/c/titanic">Titanic kaggle problem</a>

## Import libraries

In [21]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

## Load data and drop useless features

In [22]:
df_train = pd.read_csv("./csv/train.csv", index_col="PassengerId")
df_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [24]:
df_test = pd.read_csv("./csv/test.csv", index_col="PassengerId")
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [25]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 35.9+ KB

In [26]:
# Drop columns
useless_feats = ["Name", "Cabin", "Ticket"]
df_train = df_train.drop(columns=useless_feats)
df_test = df_test.drop(columns=useless_feats)

# Drop records 
df_train = df_train.loc[df_train["Embarked"].notna(), :]
df_test = df_test.loc[df_test["Fare"].notna(), :]

In [27]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 1 to 891
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       712 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Fare      889 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.5+ KB

In [28]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 417 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    417 non-null    int64
 1   Sex       417 non-null    object
 2   Age       331 non-null    float64
 3   SibSp     417 non-null    int64
 4   Parch     417 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  417 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

## Data formating and improving

### Use median to replace age NaNs

In [29]:
age_median = df_train["Age"].median()
male_age_median = df_train.loc[(df_train["Sex"] == "male"), "Age"].median()
female_age_median = df_train.loc[(df_train["Sex"] == "female"), "Age"].median()

df_train.loc[:, "Age"] = df_train["Age"].fillna(age_median)
df_test.loc[:, "Age"] = df_test["Age"].fillna(age_median)

In [30]:
print("Male age median: ", male_age_median)
print("Female age median: ", female_age_median)
print("Age median: ", age_median, "\n")

print("Training data frame age nan count: ", df_train["Age"].isna().sum())
print("Test data frame age nan count: ", df_test["Age"].isna().sum())

Male age median:  29.0
Female age median:  27.0
Age median:  28.0

Training data frame age nan count:  0
Test data frame age nan count:  0

### Encoding categorical features

In [31]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 1 to 891
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       889 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Fare      889 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.5+ KB

In [32]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 417 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    417 non-null    int64
 1   Sex       417 non-null    object
 2   Age       417 non-null    float64
 3   SibSp     417 non-null    int64
 4   Parch     417 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  417 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

In [33]:
# Sex encoding
df_train["Sex"] = df_train["Sex"].map({"female": 0, "male": 1})
df_test["Sex"] = df_test["Sex"].map({"female": 0, "male": 1})

# Embarked encoding
df_train["Embarked"] = df_train["Embarked"].map({"C": 0, "Q": 1, "S": 2})
df_test["Embarked"] = df_test["Embarked"].map({"C": 0, "Q": 1, "S": 2})

In [34]:
df_train.head()

             Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
PassengerId
1                   0       3    1  22.0      1      0   7.2500         2
2                   1       1    0  38.0      1      0  71.2833         0
3                   1       3    0  26.0      0      0   7.9250         2
4                   1       1    0  35.0      1      0  53.1000         2
5                   0       3    1  35.0      0      0   8.0500         2

In [35]:
df_test.head()

             Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
PassengerId
892               3    1  34.5      0      0   7.8292         1
893               3    0  47.0      1      0   7.0000         2
894               2    1  62.0      0      0   9.6875         1
895               3    1  27.0      0      0   8.6625         2
896               3    0  22.0      1      1  12.2875         2

### Scale continous and descrite numerical features

In [36]:
df_train.describe()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000
mean,0.382452,2.311586,0.649044,29.315152,0.524184,0.382452,32.096681,1.535433
std,0.486260,0.834700,0.477538,12.984932,1.103705,0.806761,49.697504,0.792088
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,22.000000,0.000000,0.000000,7.895800,1.000000
50%,0.000000,3.000000,1.000000,28.000000,0.000000,0.000000,14.454200,2.000000
75%,1.000000,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,2.000000

In [37]:
from sklearn.preprocessing import StandardScaler

# Age scaling
age_scaler = StandardScaler()
df_train["Age"] = age_scaler.fit_transform(df_train[["Age"]])
df_test["Age"] = age_scaler.transform(df_test[["Age"]])

# SibSp scaler
sibsp_scaler = StandardScaler()
df_train["SibSp"] = sibsp_scaler.fit_transform(df_train[["SibSp"]])
df_test["SibSp"] = sibsp_scaler.transform(df_test[["SibSp"]])

# Parch sclaer
parch_scaler = StandardScaler()
df_train["Parch"] = parch_scaler.fit_transform(df_train[["Parch"]])
df_test["Parch"] = parch_scaler.transform(df_test[["Parch"]])

fare_scaler = StandardScaler()
df_train["Fare"] = fare_scaler.fit_transform(df_train[["Fare"]])
df_test["Fare"] = fare_scaler.transform(df_test[["Fare"]])

In [38]:
df_train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
PassengerId,,,,,,,,
1,0,3,1,-0.563674,0.431350,-0.474326,-0.500240,2
2,1,1,0,0.669217,0.431350,-0.474326,0.788947,0
3,1,3,0,-0.255451,-0.475199,-0.474326,-0.486650,2
4,1,1,0,0.438050,0.431350,-0.474326,0.422861,2
5,0,3,1,0.438050,-0.475199,-0.474326,-0.484133,2

In [39]:
df_test.head()

             Pclass  Sex       Age     SibSp     Parch      Fare  Embarked
PassengerId
892               3    1  0.399522 -0.475199 -0.474326 -0.488579         1
893               3    0  1.362718  0.431350 -0.474326 -0.505273         2
894               2    1  2.518553 -0.475199 -0.474326 -0.451165         1
895               3    1 -0.178396 -0.475199 -0.474326 -0.471802         2
896               3    0 -0.563674  0.431350  0.765897 -0.398819         2

## Save data to csv file

In [40]:
df_train.to_csv("./csv/clean-train.csv")
df_test.to_csv("./csv/clean-test.csv")